In [13]:
import pandas as pd
df = pd.read_csv('schools_complete.csv')
dft = pd.read_csv('students_complete.csv')

In [15]:
df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [16]:
dft

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [61]:
dft.head(15)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84
10,10,Andrew Alexander,M,10th,Huang High School,90,70
11,11,Daniel Cooper,M,10th,Huang High School,78,77
12,12,Brittney Walker,F,9th,Huang High School,64,79
13,13,William Long,M,9th,Huang High School,71,79
14,14,Tammy Hebert,F,10th,Huang High School,85,67

In [79]:
school = df['school_name'].unique().tolist()
school

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [18]:
students = dft['Student ID'].count()
students

39170

In [19]:
budget = df['budget'].sum()
budget

24649428

In [22]:
av_math = dft['math_score'].mean()
av_math = round(av_math, 2)
av_math

78.99

In [25]:
av_r = dft['reading_score'].mean()
av_r = round(av_r,2)
av_r

81.88

In [43]:
passing_math = (dft['math_score'] >= 60).sum()
passing_math

36211

In [65]:
math_total = (dft['math_score']).count()
math_total

39170

In [66]:
p_math = (passing_math/math_total)*100
p_math = round(p_math,2)
p_math

92.45

In [71]:
passing_reading = (dft['reading_score'] >= 60).count()
passing_reading

39170

In [72]:
reading_total = dft['reading_score'].count()
reading_total

39170

In [70]:
p_read = (passing_reading/reading_total)*100
p_read = round(p_read, 2)
p_read

100.0

In [76]:
overall_passing = passing_math&passing_reading
overall_passing

35074

In [81]:
import numpy as np

math_array = np.array(dft['math_score'])
math_array

array([79, 61, 60, ..., 84, 90, 75])

In [86]:
import pandas as pd
scores_series = pd.Series([8,9,10], index=['jose', 'jorge', 'alan'])
scores_series

jose      8
jorge     9
alan     10
dtype: int64

In [87]:
scores_series*10

jose      80
jorge     90
alan     100
dtype: int64

In [94]:
# Pandas Data Frame


df = pd.DataFrame({
    'name': ['jose', 'jorge', 'alan'], 
    'age': [23, 34, 1233]
})

In [95]:
df

    name   age
0   jose    23
1  jorge    34
2   alan  1233

In [96]:
df = pd.DataFrame([
    {'name': 'jose', 'socres':8},
    {'name': 'jorge', 'socres':9},
    {'name': 'alan', 'socres':10}
])

In [97]:
df

    name  socres
0   jose       8
1  jorge       9
2   alan      10

In [101]:
df = pd.DataFrame([
    {'Frame': 'Wood', 'Price': '$187', 'Sales': 87},
    {'Frame': 'Plastic', 'Price': '$70', 'Sales': 96},
    {'Frame': 'Metal', 'Price': '$540', 'Sales': 45},
    {'Frame': 'Mixed', 'Price': '$287', 'Sales': 287},
    {'Frame': 'Paper', 'Price': '$17', 'Sales': 84}
])

In [102]:
df

     Frame Price  Sales
0     Wood  $187     87
1  Plastic   $70     96
2    Metal  $540     45
3    Mixed  $287    287
4    Paper   $17     84

In [104]:
df = pd.DataFrame({
    'Painting': ['Mona Lisa', 'El Grito', 'La Noche Estrellada', 'Las Mininas', 'La Ultima Cena'],
    'Price': ['$24324234', '$5425', '$345334', '$8765', '$983298032'],
    'Popularity': ['Enourmous', 'Big', 'Big', 'Average', 'Big']
})

In [105]:
df

              Painting       Price Popularity
0            Mona Lisa   $24324234  Enourmous
1             El Grito       $5425        Big
2  La Noche Estrellada     $345334        Big
3          Las Mininas       $8765    Average
4       La Ultima Cena  $983298032        Big

In [107]:
df.set_index('Price')

                       Painting Popularity
Price
$24324234             Mona Lisa  Enourmous
$5425                  El Grito        Big
$345334     La Noche Estrellada        Big
$8765               Las Mininas    Average
$983298032       La Ultima Cena        Big

In [108]:
df.describe()

         Painting      Price Popularity
count           5          5          5
unique          5          5          3
top     Mona Lisa  $24324234        Big
freq            1          1          3